<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"508d2c4a2e92f4a4c91070bbd65cf1ca4470c91796d45280dadc1ca2dcbe83ec","plan_job_ref":"Job Frontpage #15 at https://github.com/coverage-robot/frontpage/actions/runs/5870262611","plan_hash":"096a654ee3d9f9832afc2fe75df9dd6553e9e67e0f3a5db2dd365099956f8f13","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.static_files["assets/index-6bc7aabd.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "b7978e8da9bee9504b4bbd1f082cf6fe"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-6bc7aabd.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/index-6bc7aabd.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/index-cc9f2719.js"] will be destroyed
  # (because key ["assets/index-cc9f2719.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b217cfee7254cde62e57223623e8c243" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-cc9f2719.js" -> null
      - key                    = "assets/index-cc9f2719.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/index-cc9f2719.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ etag                   = "a68ba1ece20eca16e7f1a60a2b4279e7" -> "1f0765b5df816fa59a34814168c808af"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Frontpage #15](https://github.com/coverage-robot/frontpage/actions/runs/5870262611)